Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/Enums/ТипыПакетовДанныхСУЗ/ТипыПакетовДанныхСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПакетовДанныхСУЗ</name>
  <enumValues>
    <name>XML_V8</name>
  </enumValues>
  <enumValues>
    <name>SCORM_2004</name>
  </enumValues>
  <enumValues>
    <name>E4HOME</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыНавигацииПодборкиСУЗ/ТипыНавигацииПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНавигацииПодборкиСУЗ</name>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимМеню</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимСписком</name>
  </enumValues>
  <enumValues>
    <name>Переключатели</name>
  </enumValues>
  <enumValues>
    <name>Слайды</name>
  </enumValues>
  <enumValues>
    <name>НаОднойСтранице</name>
  </enumValues>
  <enumValues>
    <name>БезНавигации</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаИмпортаПакетаЦОР/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// ОБЩИЕ

&НаСервере
Функция ВыполнитьИмпортПакетаЦОР()
	
	НачатьТранзакцию();
	
	// Создаем узел, если его нет
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаУзел) Тогда
		
		УзелОбъект = СсылкаНаУзел.ПолучитьОбъект();
		
	Иначе
		
		УзелОбъект = ПланыОбмена.ОбменМатериаламиСУЗ.СоздатьУзел();
		
		Если ЗначениеЗаполнено(СсылкаНаУзел) Тогда
			УзелОбъект.УстановитьСсылкуНового(СсылкаНаУзел);
		КонецЕсли;
		
	КонецЕсли;
	
	УзелОбъект.Наименование = НаименованиеПакета;
	УзелОбъект.Код = ИдентификаторПакета;
	УзелОбъект.ЭтоИмпортированныйПакет = Истина;
	УзелОбъект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.E4HOME;
	
	УзелОбъект.Записать(); // Обновляем дату изменения
	
	СсылкаНаУзел = УзелОбъект.Ссылка; // Запоминаем на случай повторного нажатия кнопки Выполнить.
	
	// Создаем ресурс для хранения общих или всех файлов
	
	РесурсКонтейнер = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПакета));
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(РесурсКонтейнер) Тогда
			
		РесурсКонтейнерОбъект = РесурсКонтейнер.ПолучитьОбъект();
		
		ГруппаРесурсовПакета = РесурсКонтейнерОбъект.Родитель;
		
	Иначе
		
		// Создаем новый ресурс-контейнер
		
		РесурсКонтейнерОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
		
		РесурсКонтейнерОбъект.УстановитьСсылкуНового(РесурсКонтейнер);
		
		// Создаем для нового ресурсов группу
		
		ГруппаРесурсовПакетаОбъект = Справочники.РесурсыСУЗ.СоздатьГруппу();
		
		ГруппаРесурсовПакетаОбъект.Наименование = НаименованиеПакета;
		ГруппаРесурсовПакетаОбъект.Поставщик = ПоставщикПакета;
		
		ГруппаРесурсовПакетаОбъект.Записать();
		
		ГруппаРесурсовПакета = ГруппаРесурсовПакетаОбъект.Ссылка;
		
		// Указываем группу
		
		РесурсКонтейнерОбъект.Родитель = ГруппаРесурсовПакета;
		
	КонецЕсли;
	
	РесурсКонтейнерОбъект.Наименование = КодПакета; 
    РесурсКонтейнерОбъект.Поставщик    = ПоставщикПакета;
	
	РесурсКонтейнерОбъект.Записать();
		
	// Создаем группу подборок
	
	ГруппаПодборокПакета = Справочники.ПодборкиСУЗ.ПолучитьСсылку(ГруппаРесурсовПакета.УникальныйИдентификатор()); 
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ГруппаПодборокПакета) Тогда
		
		ГруппаПодборокПакетаОбъект = ГруппаПодборокПакета.ПолучитьОбъект();
		
	Иначе
		
		ГруппаПодборокПакетаОбъект = Справочники.ПодборкиСУЗ.СоздатьГруппу();
		ГруппаПодборокПакетаОбъект.УстановитьСсылкуНового(ГруппаПодборокПакета);
		
	КонецЕсли;
	
	ГруппаПодборокПакетаОбъект.Наименование = НаименованиеПакета;
	ГруппаПодборокПакетаОбъект.Поставщик = ПоставщикПакета;
	
	ГруппаПодборокПакетаОбъект.Записать();
	
	ГруппаПодборокПакета = ГруппаПодборокПакетаОбъект.Ссылка;
	
	// Обрабатываем электронные ресурсы (рубрикаторы)
	
	Для каждого СтрокаЭР Из Рубрикаторы Цикл
		
		Если НЕ СтрокаЭР.Загрузить Тогда
			Продолжить;
		КонецЕсли;
		
		// Создаем поставщика
	
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаЭР.Поставщик) Тогда
			
			ПоставщикОбъект = СтрокаЭР.Поставщик.ПолучитьОбъект();
			
		Иначе
			
			ПоставщикОбъект = Справочники.ПоставщикиСУЗ.СоздатьЭлемент();
			
			ПоставщикОбъект.УстановитьСсылкуНового(СтрокаЭР.Поставщик); // Есть ссылка всегда
			
		КонецЕсли;
			
		ПоставщикОбъект.Наименование = СтрокаЭР.НаименованиеПоставщика; 
		
		ПоставщикОбъект.Записать();
			
		// Создаем электронный ресурс
		
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаЭР.ЭлектронныйРесурс) Тогда
			
			ЭлектронныйРесурсОбъект = СтрокаЭР.ЭлектронныйРесурс.ПолучитьОбъект();
			
		Иначе
			
			ЭлектронныйРесурсОбъект = Справочники.СводыЗнанийСУЗ.СоздатьЭлемент();
			
			ЭлектронныйРесурсОбъект.УстановитьСсылкуНового(СтрокаЭР.ЭлектронныйРесурс); // Есть ссылка всегда
			
		КонецЕсли;
		
		ЭлектронныйРесурсОбъект.Тип           = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс;
		ЭлектронныйРесурсОбъект.Наименование  = СтрокаЭР.Наименование + "(" + СтрокаЭР.Описание + ")";
		ЭлектронныйРесурсОбъект.Редакция      = РедакцияПакета;
		ЭлектронныйРесурсОбъект.Версия        = ВерсияПакета;
        ЭлектронныйРесурсОбъект.Поставщик     = СтрокаЭР.Поставщик;
		ЭлектронныйРесурсОбъект.Идентификатор = КодПакета;
		
		Если ИмпортироватьКакОдинРесурс Тогда
		
			СтрокаТЧЗР = ЭлектронныйРесурсОбъект.СкрытыеРесурсы.Найти(РесурсКонтейнер, "Ресурс");
			
			Если СтрокаТЧЗР = Неопределено Тогда
				СтрокаТЧЗР = ЭлектронныйРесурсОбъект.СкрытыеРесурсы.Добавить();
			КонецЕсли;
			
			СтрокаТЧЗР.Ресурс = РесурсКонтейнер;
			СтрокаТЧЗР.Размер = РазмерФайлаПакета;
			СтрокаТЧЗР.ВыгружатьПриОткрытии = Истина;
			
		КонецЕсли;
			
		ЭлектронныйРесурсОбъект.Записать();
			
		// Создаем содержание электронного ресурса
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(СтрокаЭР.ПутьКФайлуОписания);
		
		LOMXDTOТип = ФабрикаXDTO.Тип("http://ltsc.ieee.org/xsd/LOM", "lom");
		LOMXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, LOMXDTOТип);
		
		Для каждого classification Из LOMXDTO.classification Цикл
			
			// Ищем элемент classification, соответствующий рубрикатору ЦОР, т.е. содержанию
			
			Если classification.purpose.count() > 0
				И classification.purpose[0].value.count() > 0
				И classification.purpose[0].value[0].__content = "prerequisite" Тогда
				
				СписокTaxon = classification.taxonPath.taxon[0].taxon;
				
				ЗаписатьГруппыЭлементовСодержания(СписокTaxon, СтрокаЭР.ЭлектронныйРесурс, СтрокаЭР.Поставщик);
				
				Прервать;
				
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	// Распаковываем все ресурсы пакета
	
	ПутьККаталогуРесурсов = ПутьКРесурсамПакета + "res";
	ПутьККаталогуРесурсов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурсов);

	СоздатьКаталог(ПутьККаталогуРесурсов);
	
	ФайлыРесурсов = НайтиФайлы(ПутьКРесурсамПакета, "DL_RES_*.zip");
	
	Для каждого ФайлРесурса Из ФайлыРесурсов Цикл
	
		КаталогРесурса = ПутьККаталогуРесурсов + ФайлРесурса.ИмяБезРасширения;
		КаталогРесурса = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогРесурса);	
		
		СоздатьКаталог(КаталогРесурса);
		
		Попытка
			ФайлАрхива = Новый ЧтениеZIPФайла(ФайлРесурса.ПолноеИмя);
			ФайлАрхива.ИзвлечьВсе(КаталогРесурса, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 				
		Исключение
			ВызватьИсключение ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;	
	
	// Распаковываем общий набор файлов
	
	ФайлОбщихФайловОбъект = Новый Файл(ПутьКРесурсамПакета + "common.zip");
	
	Если ФайлОбщихФайловОбъект.Существует() Тогда
		
		Попытка
			ФайлАрхива = Новый ЧтениеZIPФайла(ФайлОбщихФайловОбъект.ПолноеИмя);
			ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРесурсов, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 				
		Исключение
			ВызватьИсключение ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Копируем файл настроек
	
	КопироватьФайл(ПутьКРесурсамПакета + "setup.xml", ПутьККаталогуРесурсов + "index.xml");
	
	// Помещаем файлы в базу (все или только общие в зависимости от настройки)
	
	СтруктураФайлов    = Новый Массив(); // Массив файлов с учетом иерархии каталогов
	СписокФайлов       = Новый Массив(); // Линейный список файлов для последующего помещения во временное хранилище
	КаталогДляЗагрузки = Новый Массив();
	
	// Выбираем все ранее помещенные файлы

	ВыборкаФайловВБазе = Справочники.РесурсыСУЗ.ВыборкаФайлов(РесурсКонтейнер);
	
	Если ИмпортироватьКакОдинРесурс Тогда
	
		// Запоминаем все файлы ресурсов
		
		КаталогДляЗагрузки.Добавить(Новый Файл(ПутьККаталогуРесурсов));
		
		ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(КаталогДляЗагрузки, СтруктураФайлов, СписокФайлов, Истина);
	
		// Записываем все файлы или только общие файлы в один ресурс
		
		ТаблицаЗаписанныхФайлов = Новый ТаблицаЗначений();
		ТаблицаЗаписанныхФайлов.Колонки.Добавить("ПолноеИмя");
		ТаблицаЗаписанныхФайлов.Колонки.Добавить("ЭтоГруппа");
		ТаблицаЗаписанныхФайлов.Колонки.Добавить("Ссылка");
			
		ЗаписатьФайлыРесурса(РесурсКонтейнер, Справочники.ФайлыСУЗ.ПустаяСсылка(), СтруктураФайлов[0].ПодчиненныеФайлы, ВыборкаФайловВБазе, ТаблицаЗаписанныхФайлов);
		
	Иначе
		
		// Запоминаем все файлы, кроме каталогов ресурсов (DL_RES)
		
		ВсеЭлементыВКаталогеРесурсов = НайтиФайлы(ПутьККаталогуРесурсов, "*", Ложь);
		
		ВсеСлужебныеФайлыВКаталогеРесурсов = Новый Массив(); // Файлы, которые не надо помещать в контейнер общих файлов
		
		МаскиСлужебныхФайлов = Новый Массив();
		МаскиСлужебныхФайлов.Добавить("DL_RES_*");
		МаскиСлужебныхФайлов.Добавить("DL_RUB_*");
		МаскиСлужебныхФайлов.Добавить("temp");
		МаскиСлужебныхФайлов.Добавить("res*");
		МаскиСлужебныхФайлов.Добавить("index.xml");
		
		Для каждого МаскаСФ Из МаскиСлужебныхФайлов Цикл
		
			НайденныеФайлыПоМаске = НайтиФайлы(ПутьККаталогуРесурсов, МаскаСФ, Ложь);
			
			Для каждого ФайлПоМаске Из НайденныеФайлыПоМаске Цикл
			
				ВсеСлужебныеФайлыВКаталогеРесурсов.Добавить(ФайлПоМаске);	
			
			КонецЦикла;
		
		КонецЦикла;
		
		Для каждого ЭлементВКаталогеРесурсов Из ВсеЭлементыВКаталогеРесурсов Цикл
			
			ЭтоРесурс = Истина;
			
			Для каждого ФайлОбъект Из ВсеСлужебныеФайлыВКаталогеРесурсов Цикл
			
				Если ФайлОбъект.ПолноеИмя = ЭлементВКаталогеРесурсов.ПолноеИмя Тогда
					ЭтоРесурс = Ложь;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			Если ЭтоРесурс Тогда
				
				КаталогДляЗагрузки.Добавить(ЭлементВКаталогеРесурсов);
				
			КонецЕсли;
				
		КонецЦикла;
		
		ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(КаталогДляЗагрузки, СтруктураФайлов, СписокФайлов, Истина);
			
		ЗаписатьФайлыРесурса(РесурсКонтейнер, Справочники.ФайлыСУЗ.ПустаяСсылка(), СтруктураФайлов, ВыборкаФайловВБазе);
		
	КонецЕсли;
	
	
	// Указываем стартовый файл

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = &Владелец
		|	И ФайлыСУЗ.Родитель = &Родитель
		|	И ФайлыСУЗ.ИмяФайла = &ИмяФайла";

	Запрос.УстановитьПараметр("Владелец", РесурсКонтейнер);
	Запрос.УстановитьПараметр("ИмяФайла", "index.xml");
	Запрос.УстановитьПараметр("Родитель", Справочники.ФайлыСУЗ.ПустаяСсылка());

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		РесурсКонтейнерОбъект = РесурсКонтейнер.ПолучитьОбъект();
		
		РесурсКонтейнерОбъект.ФайлЗапуска = ВыборкаДетальныеЗаписи.Ссылка;
		
		РесурсКонтейнерОбъект.Записать();
	
	КонецЕсли;
	
	// Формируем для каждого набора файлов с описанием свой ресурс
	
	ФайлыОписанияРесурсов = НайтиФайлы(ПутьККаталогуРесурсов, "LOM_resource.xml", Истина);
	
	Для каждого ФайлLOM Из ФайлыОписанияРесурсов Цикл
		
		// Обозначаем основные переменные
		
		КаталогРесурса = ФайлLOM.Путь;
		КаталогРесурса = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогРесурса);
		
		ФайлМанифестаРесурса = Новый Файл(КаталогРесурса + "imsmanifest.xml");
		
		ТаблицаЭлементовСодержания = Новый ТаблицаЗначений;
		ТаблицаЭлементовСодержания.Колонки.Добавить("ЭлектронныйРесурс");
		ТаблицаЭлементовСодержания.Колонки.Добавить("ЭлементСодержания");
		ТаблицаЭлементовСодержания.Колонки.Добавить("Родитель");
		ТаблицаЭлементовСодержания.Колонки.Добавить("Наименование");
		ТаблицаЭлементовСодержания.Колонки.Добавить("Номер");
		ТаблицаЭлементовСодержания.Колонки.Добавить("СсылкаНаЭлемент");
		
		ТаблицаРесурсов = Новый ТаблицаЗначений;
		ТаблицаРесурсов.Колонки.Добавить("Ресурс");
		ТаблицаРесурсов.Колонки.Добавить("Номер");
		ТаблицаРесурсов.Колонки.Добавить("Идентификатор");
		ТаблицаРесурсов.Колонки.Добавить("Наименование");
		ТаблицаРесурсов.Колонки.Добавить("ПутьКСтартовомуФайлу");
		ТаблицаРесурсов.Колонки.Добавить("SCO");
		ТаблицаРесурсов.Колонки.Добавить("Каталог");
		
		// Делаем проверки
		
		Если НЕ ФайлМанифестаРесурса.Существует() Тогда
			ВызватьИсключение НСтр("ru = 'Файл манифеста не найден'");
		КонецЕсли;
		
		// Получаем объектную модель файла imsmanifest.xml
		
		ЧтениеXMLSCORM = Новый ЧтениеXML;
		ЧтениеXMLSCORM.ОткрытьФайл(ФайлМанифестаРесурса.ПолноеИмя);
		
		МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
		МанифестXDTO = ФабрикаXDTO.Создать(МанифестТип);
		МанифестXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXMLSCORM, МанифестТип);
		
		ЧтениеXMLSCORM.Закрыть();
		
		// Получаем объектную модель файла LOM_resource.xml
		
		ЧтениеXMLLOM = Новый ЧтениеXML;
		ЧтениеXMLLOM.ОткрытьФайл(ФайлLOM.ПолноеИмя);
		
		LOMXDTOТип = ФабрикаXDTO.Тип("http://ltsc.ieee.org/xsd/LOM", "lom");
		LOMXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXMLLOM, LOMXDTOТип);
		
		ЧтениеXMLLOM.Закрыть();;
		
		// Получаем общие данные всего ресурса
		
		ИдентификаторРесурса = Новый УникальныйИдентификатор(LOMXDTO.general.identifier.entry.__content);
		НаименованиеРесурса = LOMXDTO.general.title.string.__content;
		ЭтоПодборка = ?(МанифестXDTO.organizations.organization.count() > 0, Истина, Ложь);
		
		
		// Получаем данные о месте ресурса в содержании электронного ресурса
		
		Для каждого classification Из LOMXDTO.classification Цикл
			
			ЭлектронныйРесурсРесурса = Неопределено;
			
			Если classification.taxonPath.source <> Неопределено
				И classification.taxonPath.source.string.count() > 0 Тогда
				
				Для каждого string Из classification.taxonPath.source.string Цикл
				
					Если string.language = "x-GUID"Тогда
						
						ЭлектронныйРесурсРесурса = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(string.__content));
							
						Прервать;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлектронныйРесурсРесурса)
				И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурсРесурса)
				И classification.taxonPath.taxon.count() > 0 Тогда
				
				ИдентификаторРодителя = classification.taxonPath.taxon[0].id.__content; // Идентификатор элемента рубрикатора
				ИдентификаторЭлементаСодержания = ОбщегоНазначенияСУ.УникальныйИдентификаторИзСтроки(НРег(Строка(ИдентификаторРесурса) + Строка(ЭлектронныйРесурсРесурса.УникальныйИдентификатор()) + Строка(ИдентификаторРодителя)));
				
				НоваяСтрока = ТаблицаЭлементовСодержания.Добавить();
				
				НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурсРесурса;
				НоваяСтрока.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый уникальныйИдентификатор(ИдентификаторЭлементаСодержания));
				НоваяСтрока.Родитель          = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторРодителя));
				НоваяСтрока.Наименование      = НаименованиеРесурса; //classification.taxonPath.taxon[0].entry.string.__content;
				НоваяСтрока.Номер             = classification.taxonPath.taxon[0].order;
				
				Если ЭтоПодборка Тогда
					НоваяСтрока.СсылкаНаЭлемент = Справочники.ПодборкиСУЗ.ПолучитьСсылку(ИдентификаторРесурса);
				Иначе
					НоваяСтрока.СсылкаНаЭлемент = Справочники.РесурсыСУЗ.ПолучитьСсылку(ИдентификаторРесурса);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаЭлементовСодержания.Количество() = 0 Тогда
			
			Текст = НСтр("ru = 'Ресурс ""%1"" не имеет ни одного доступного рубрикатора'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ИдентификаторРесурса);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			
			Продолжить;
			
		КонецЕсли;
		
		// Заполняем данные о ресурсах или вопросах, которые будут созданы в базе данных
		
		Если ЭтоПодборка Тогда
			
			НомерРесурса = 0;
			
			НаименованиеПодборки = МанифестXDTO.organizations.organization[0].title;
			
			Для каждого item Из МанифестXDTO.organizations.organization[0].item Цикл
			
				НомерРесурса = НомерРесурса + 1;
				
				СвойстваРесурса = Неопределено;
				
				Для каждого resource Из МанифестXDTO.resources.resource Цикл
					Если item.identifierref	= resource.identifier Тогда
						СвойстваРесурса = resource;
						Прервать;	
					КонецЕсли;
				КонецЦикла;	
				
				Если СвойстваРесурса = Неопределено Тогда
					ВызватьИсключение НСтр("ru = 'Свойства ресурса не определены'");	
				КонецЕсли;
				
				Если Нрег(СвойстваРесурса.scormType) = "imsqti" Тогда
					
					//!!!!
					
				Иначе
					
					НоваяСтрока = ТаблицаРесурсов.Добавить(); 
					НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор(СвойстваРесурса.identifier);
					НоваяСтрока.Ресурс = Справочники.РесурсыСУЗ.ПолучитьСсылку(НоваяСтрока.Идентификатор);
					НоваяСтрока.Наименование = ?(ЗначениеЗаполнено(item.title), НаименованиеРесурса + " (" + item.title + ")", НаименованиеРесурса + " (" + НомерРесурса + ")");
					НоваяСтрока.ПутьКСтартовомуФайлу = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогРесурса + СвойстваРесурса.base + СвойстваРесурса.href);
					НоваяСтрока.SCO = ?(Нрег(СвойстваРесурса.scormType) = "sco", Истина, Ложь);
					НоваяСтрока.Номер = НомерРесурса;
					НоваяСтрока.Каталог = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогРесурса);
					
				КонецЕсли;
				
				
			КонецЦикла;
					
		Иначе
			
			НоваяСтрока = ТаблицаРесурсов.Добавить(); 
			НоваяСтрока.Идентификатор = ИдентификаторРесурса;
			НоваяСтрока.Ресурс = Справочники.РесурсыСУЗ.ПолучитьСсылку(НоваяСтрока.Идентификатор);
			НоваяСтрока.Наименование = НаименованиеРесурса;
			НоваяСтрока.ПутьКСтартовомуФайлу = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогРесурса + МанифестXDTO.resources.resource[0].base + МанифестXDTO.resources.resource[0].href);
			НоваяСтрока.SCO = ?(Нрег(МанифестXDTO.resources.resource[0].scormType) = "sco", Истина, Ложь);
			НоваяСтрока.Номер = 1;
			НоваяСтрока.Каталог = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогРесурса);
			
		КонецЕсли;
		
		// Записываем ресурсы в базу
		
		Для каждого СтрокаТР Из ТаблицаРесурсов Цикл
		
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТР.Ресурс) Тогда
				РесурсТРОбъект = СтрокаТР.Ресурс.ПолучитьОбъект();
			Иначе
				РесурсТРОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
				РесурсТРОбъект.УстановитьСсылкуНового(СтрокаТР.Ресурс);
			КонецЕсли;
			
			РесурсТРОбъект.Родитель = ГруппаРесурсовПакета;
			
			РесурсТРОбъект.Наименование = СтрокаТР.Наименование;
			РесурсТРОбъект.Поставщик = ПоставщикПакета;
			РесурсТРОбъект.SCO = СтрокаТР.SCO;
			
			Если ИмпортироватьКакОдинРесурс Тогда
				
				// Указываем идентичный ресурс
				
				РесурсТРОбъект.ИдентичныйРесурс = РесурсКонтейнер;
				
				Для каждого СтрокаТЗФ Из ТаблицаЗаписанныхФайлов Цикл
				
					Если НРег(СтрокаТЗФ.ПолноеИмя) = НРег(СтрокаТР.ПутьКСтартовомуФайлу) Тогда
						РесурсТРОбъект.ФайлЗапуска = СтрокаТЗФ.Ссылка;
						Прервать;
					КонецЕсли;
				
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(РесурсТРОбъект.ФайлЗапуска) Тогда
					
					Текст = НСтр("ru = 'Файл запуска ресурса ""%1"" не найден'");
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Строка(СтрокаТР.Ресурс.УникальныйИдентификатор()));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					
					Продолжить;
					
					Продолжить; // Пропускаем ресурс
					
				КонецЕсли;
				
			КонецЕсли;
			
			РесурсТРОбъект.Записать();
			
			// Помещаем файлы в ресурс
			
			Если НЕ ИмпортироватьКакОдинРесурс Тогда
				
				// Указываем зависимый ресурс

				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗависимыеРесурсыСУЗ.Ссылка
					|ИЗ
					|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
					|ГДЕ
					|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ЗависимыеРесурсыСУЗ.Владелец = &ВладелецРесурс
					|	И ЗависимыеРесурсыСУЗ.Ресурс = &ЗависимыйРесурс";

				Запрос.УстановитьПараметр("ВладелецРесурс", РесурсТРОбъект.Ссылка);
				Запрос.УстановитьПараметр("ЗависимыйРесурс", РесурсКонтейнер);

				Результат = Запрос.Выполнить();

				Если Результат.Пустой() Тогда
					
					ЗависимыйРесурсОбъект = Справочники.ЗависимыеРесурсыСУЗ.СоздатьЭлемент();
					
					ЗависимыйРесурсОбъект.Владелец = РесурсТРОбъект.Ссылка; 
					
					ЗависимыйРесурсОбъект.Поставщик = ПоставщикПакета;	
					
				Иначе
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					ВыборкаДетальныеЗаписи.Следующий();
					
					ЗависимыйРесурсОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
					
				КонецЕсли;
				
				ЗависимыйРесурсОбъект.Наименование = НСтр("ru = 'Общие файлы'");
				ЗависимыйРесурсОбъект.Ресурс = РесурсКонтейнер;
				ЗависимыйРесурсОбъект.Дополняет = Истина;
				
				ЗависимыйРесурсОбъект.Записать();
				
				// Помещаем файлы  в ресурс
				
				СтруктураФайлов    = Новый Массив(); // Массив файлов с учетом иерархии каталогов
				СписокФайлов       = Новый Массив(); // Линейный список файлов для последующего помещения во временное хранилище
				КаталогДляЗагрузки = Новый Массив();
				
				КаталогДляЗагрузки.Добавить(Новый Файл(СтрокаТР.Каталог));
					
				ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(КаталогДляЗагрузки, СтруктураФайлов, СписокФайлов, Истина);
				
				ВыборкаФайловВБазе = Справочники.РесурсыСУЗ.ВыборкаФайлов(СтрокаТР.Ресурс);
				
				ТаблицаЗаписанныхФайлов = Новый ТаблицаЗначений();
				ТаблицаЗаписанныхФайлов.Колонки.Добавить("ПолноеИмя");
				ТаблицаЗаписанныхФайлов.Колонки.Добавить("ЭтоГруппа");
				ТаблицаЗаписанныхФайлов.Колонки.Добавить("Ссылка");
				
				ЗаписатьФайлыРесурса(СтрокаТР.Ресурс, Справочники.ФайлыСУЗ.ПустаяСсылка(), СтруктураФайлов, ВыборкаФайловВБазе, ТаблицаЗаписанныхФайлов);
				
				Для каждого СтрокаТЗФ Из ТаблицаЗаписанныхФайлов Цикл
				
					Если НРег(СтрокаТЗФ.ПолноеИмя) = НРег(СтрокаТР.ПутьКСтартовомуФайлу) Тогда
						
						РесурсТРОбъект.ФайлЗапуска = СтрокаТЗФ.Ссылка;
						РесурсТРОбъект.Записать(); // Записываем стартовый файл
						
						Прервать;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Записываем подборку и элемент содержания
		
		Если ЭтоПодборка Тогда
			
			// Проверяем, есть ли ресурсы SCO
			
			ЕстьРесурсыSCO = Ложь;
			
			Для каждого СтрокаТР Из ТаблицаРесурсов Цикл
			
				Если СтрокаТР.SCO Тогда
					ЕстьРесурсыSCO = Истина;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			// Записываем подборку
			
			ПодборкаРесурса = Справочники.ПодборкиСУЗ.ПолучитьСсылку(ИдентификаторРесурса);
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ПодборкаРесурса) Тогда	
				
				ПодборкаРесурсаОбъект = ПодборкаРесурса.ПолучитьОбъект();
				
			Иначе
				
				ПодборкаРесурсаОбъект = Справочники.ПодборкиСУЗ.СоздатьЭлемент();
				ПодборкаРесурсаОбъект.УстановитьСсылкуНового(ПодборкаРесурса);
				
				ПодборкаРесурсаОбъект.Родитель = ГруппаПодборокПакета;
				
			КонецЕсли;
			
			ПодборкаРесурсаОбъект.Наименование = ?(ЗначениеЗаполнено(НаименованиеПодборки), НаименованиеПодборки, НаименованиеРесурса);
			ПодборкаРесурсаОбъект.ПоказыватьСтартовуюСтраницу = ЕстьРесурсыSCO;
			ПодборкаРесурсаОбъект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Последовательно;
			ПодборкаРесурсаОбъект.Поставщик = ПоставщикПакета;
			
			ПодборкаРесурсаОбъект.Записать();
			
			// Записываем элементы подборки
			
			Для каждого СтрокаТР Из ТаблицаРесурсов Цикл
				
				ЭлементПодборкиРесурса = Справочники.ЭлементыПодборкиСУЗ.ПолучитьСсылку(СтрокаТР.Идентификатор);
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлементПодборкиРесурса) Тогда	
					
					ЭлементПодборкиРесурсаОбъект = ЭлементПодборкиРесурса.ПолучитьОбъект();
					
				Иначе
					
					ЭлементПодборкиРесурсаОбъект = Справочники.ЭлементыПодборкиСУЗ.СоздатьЭлемент();
					ЭлементПодборкиРесурсаОбъект.УстановитьСсылкуНового(ЭлементПодборкиРесурса);
					
				КонецЕсли;
				
				ЭлементПодборкиРесурсаОбъект.Владелец = ПодборкаРесурса;
				ЭлементПодборкиРесурсаОбъект.Код = СтрокаТР.Номер;
				ЭлементПодборкиРесурсаОбъект.Наименование = СтрокаТР.Наименование;
				ЭлементПодборкиРесурсаОбъект.СсылкаНаОбъектСУЗ = СтрокаТР.Ресурс;
				ЭлементПодборкиРесурсаОбъект.Поставщик = ПоставщикПакета;
				
				ЭлементПодборкиРесурсаОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Записываем элементы содержания
		
		Для каждого СтрокаТЭС Из ТаблицаЭлементовСодержания Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТЭС.ЭлементСодержания) Тогда	
				
				ЭлементСодержанияРесурсаОбъект = СтрокаТЭС.ЭлементСодержания.ПолучитьОбъект();
				
			Иначе
				
				ЭлементСодержанияРесурсаОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
				ЭлементСодержанияРесурсаОбъект.УстановитьСсылкуНового(СтрокаТЭС.ЭлементСодержания);
				
				ЭлементСодержанияРесурсаОбъект.Родитель = СтрокаТЭС.Родитель;
				
			КонецЕсли;
			
			ЭлементСодержанияРесурсаОбъект.Владелец = СтрокаТЭС.ЭлектронныйРесурс;
			ЭлементСодержанияРесурсаОбъект.Наименование = СтрокаТЭС.Наименование;
			
			Попытка
				ЭлементСодержанияРесурсаОбъект.Код = Число(СтрокаТЭС.Номер);
			Исключение
				ЭлементСодержанияРесурсаОбъект.Код = 1; // НЕ 0, чтобы не было автонумерации
			КонецПопытки;
			
			ЭлементСодержанияРесурсаОбъект.СсылкаНаЭлемент = СтрокаТЭС.СсылкаНаЭлемент;
			ЭлементСодержанияРесурсаОбъект.Поставщик = ПоставщикПакета;
			
			Если ЭлементСодержанияРесурсаОбъект.Владелец <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержанияРесурсаОбъект.Родитель, "Владелец")  Тогда
				
				Текст = НСтр("ru = 'Нарушена уникальность идентификатора у ресурса ""%1"" ""%2""'");
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ИдентификаторРесурса, Строка(ЭлементСодержанияРесурсаОбъект.Владелец.УникальныйИдентификатор()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				
				Продолжить;
				
			КонецЕсли;
			
			ЭлементСодержанияРесурсаОбъект.ДополнительныеСвойства.Вставить("ОтменитьУстановкуКода", Истина);
			
			ЭлементСодержанияРесурсаОбъект.Записать();
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();	
	
	ЭлектронныеРесурсыПереопределяемый.ПослеЗагрузкиЭлектронногоРесурса();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаписатьГруппыЭлементовСодержания(СписокTaxon, ЭлектронныйРесурс, Поставщик, Родитель=Неопределено)
	
	Номер = 0;
	
	Для каждого taxon Из СписокTaxon Цикл
		
		Номер = Номер + 1;
		
		ИдентификаторЭлемента = taxon.id.__content;
		НаименованиеЭлемента = taxon.entry.string.__content;
		
		ЭлементСодержания = ОбщегоНазначенияСУ.ЭлементСправочникаПоИдентификатору("СодержаниеСУЗ", ИдентификаторЭлемента);
		
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлементСодержания) Тогда
			
			ЭлементСодержанияОбъект = ЭлементСодержания.ПолучитьОбъект();
			
		Иначе
			
			ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьГруппу();
			
			ЭлементСодержанияОбъект.УстановитьСсылкуНового(ЭлементСодержания); // Есть ссылка всегда
			
		КонецЕсли;
		
		ЭлементСодержанияОбъект.Код = Номер;
		ЭлементСодержанияОбъект.Владелец = ЭлектронныйРесурс; 
		ЭлементСодержанияОбъект.Поставщик = Поставщик;
		ЭлементСодержанияОбъект.Родитель = Родитель;
		ЭлементСодержанияОбъект.Наименование = НаименованиеЭлемента;
		
		ЭлементСодержанияОбъект.Записать();
		
		Если taxon.taxon.count() > 0 Тогда
			ЗаписатьГруппыЭлементовСодержания(taxon.taxon, ЭлектронныйРесурс, Поставщик, ЭлементСодержания); // Рекурсия
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлыРесурса(Ресурс, Знач Родитель=Неопределено, СтруктураФайлов, ВыборкаФайловВБазе, ТаблицаЗаписанныхФайлов=Неопределено)
	
	Для каждого Файл Из СтруктураФайлов Цикл
		
		Если ТаблицаЗаписанныхФайлов <> Неопределено Тогда
			
			НоваяСтрокаТЗФ = ТаблицаЗаписанныхФайлов.Добавить();
			НоваяСтрокаТЗФ.ПолноеИмя = Файл.ПолноеИмя;
			НоваяСтрокаТЗФ.ЭтоГруппа = Файл.ЭтоКаталог;
			
		КонецЕсли;
			
		Если Файл.ЭтоКаталог Тогда
			
			// Ищем каталог в базе
			
			СтруктураПоиска = Новый Структура("ИмяФайла, Родитель, ЭтоГруппа", Файл.Имя, Родитель, Истина);
			
			ВыборкаФайловВБазе.Сбросить();
			Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда
				НовыйКаталог = ВыборкаФайловВБазе.Ссылка.ПолучитьОбъект();
			Иначе
				НовыйКаталог = Справочники.ФайлыСУЗ.СоздатьГруппу();	
			КонецЕсли;
			
			// Заполняем реквизиты каталога 
			НовыйКаталог.Владелец     = Ресурс;
			НовыйКаталог.ИмяФайла     = Файл.Имя;
			НовыйКаталог.Наименование = Файл.Имя;
			НовыйКаталог.Родитель     = Родитель;
			НовыйКаталог.Поставщик    = ПоставщикПакета;
			
			НовыйКаталог.ДополнительныеСвойства.Вставить("ПропуститьКонтрольУникальностиИмениФайла", Истина);
			НовыйКаталог.ОбменДанными.Загрузка = Истина;
			НовыйКаталог.Записать();
			
			Если ТаблицаЗаписанныхФайлов <> Неопределено Тогда
				НоваяСтрокаТЗФ.Ссылка = НовыйКаталог.Ссылка;
			КонецЕсли;
			
			ЗаписатьФайлыРесурса(Ресурс, НовыйКаталог.Ссылка, Файл.ПодчиненныеФайлы, ВыборкаФайловВБазе, ТаблицаЗаписанныхФайлов); // Рекурсия
			
		Иначе
			
			// Ищем файл в базе
			
			СтруктураПоиска = Новый Структура("ИмяФайла, Родитель, ЭтоГруппа", Файл.Имя, Родитель, Ложь);
			
			ВыборкаФайловВБазе.Сбросить();
			
			Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда
				
				НовыйФайл = ВыборкаФайловВБазе.Ссылка.ПолучитьОбъект();
				
			Иначе
				
				НовыйФайл = Справочники.ФайлыСУЗ.СоздатьЭлемент();
				НовыйФайл.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(Файл.Расширение);
				
				Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Default
					И НЕ РазработкаСУЗ.ЭтоФайлHTML(Файл.Расширение) Тогда
					
					НовыйФайл.ОткрыватьВнешнимПриложением = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Заполняем реквизиты файла
			
			НовыйФайл.Родитель      = Родитель;
			НовыйФайл.Владелец      = Ресурс;
			НовыйФайл.ИмяФайла      = Файл.Имя;
			НовыйФайл.Наименование  = Файл.ИмяБезРасширения;
			НовыйФайл.ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.file;
			
			// Версию указываем только для новых файлов
			
			Если НовыйФайл.Ссылка.Пустая() Тогда
				НовыйФайл.Версия = 1; 
			КонецЕсли;
			
			Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Media Тогда
				НовыйФайл.Ширина      = "100%";
				НовыйФайл.Высота      = "100%";
				НовыйФайл.FlashВерсия = 9;
			КонецЕсли;
			
			НовыйФайл.Поставщик = ПоставщикПакета;
			
			НовыйФайл.ДополнительныеСвойства.Вставить("ПропуститьКонтрольУникальностиИмениФайла", Истина);
			НовыйФайл.ОбменДанными.Загрузка = Истина;
			НовыйФайл.Записать();
			
			Если ТаблицаЗаписанныхФайлов <> Неопределено Тогда
				НоваяСтрокаТЗФ.Ссылка = НовыйФайл.Ссылка;
			КонецЕсли;
			
			// Сохраняем данные файла
			
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйФайл, "", "Описание");
			
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
			
			РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(НовыйФайл, ДвоичныеДанныеФайла);
			
		КонецЕсли;

	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРубрикаторВТаблицу(Знач ПутьККаталогуФайловРубрикатора, Отказ)
	
	ПутьККаталогуФайловРубрикатора = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуФайловРубрикатора);
	
	ФайлОписанияРубрикатора = Новый Файл(ПутьККаталогуФайловРубрикатора + "LOM_rubricator.xml");
	
	Если ФайлОписанияРубрикатора.Существует() Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ФайлОписанияРубрикатора.ПолноеИмя);
		
		LOMXDTOТип = ФабрикаXDTO.Тип("http://ltsc.ieee.org/xsd/LOM", "lom");
		LOMXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, LOMXDTOТип);
		
		// Ищем данные о поставщике, среди классификаторов
		
		Для каждого classification Из LOMXDTO.classification Цикл
			
			ЭтоКлассификаторПоставщика = Ложь;
			
			Если classification.taxonPath <> Неопределено
				И classification.taxonPath.source <> Неопределено
				И classification.taxonPath.source.string.count() > 0 Тогда
				
				Для каждого string Из classification.taxonPath.source.string Цикл
				
					Если string.language = "x-GUID"	И НРег(string.__content) = "ccad6820-8690-11da-a72b-0800200c9a66" Тогда
						
						ЭтоКлассификаторПоставщика = Истина;
						
						Прервать;
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЭтоКлассификаторПоставщика	И classification.taxonPath.taxon.count() > 0 Тогда
				
				НаименованиеПоставщика = classification.taxonPath.taxon[0].entry.string.__content;
				ИдентификаторПоставщика = classification.taxonPath.taxon[0].id.__content;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторПоставщика)
			ИЛИ НЕ ЗначениеЗаполнено(НаименованиеПоставщика) Тогда
			
			Текст = НСтр("ru = 'Данные о поставщике не найдены'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;	
			
		КонецЕсли;
		
		Если ВРег(ИдентификаторПоставщика) <> "E8599AD0-8690-11DA-A72B-0800200C9A66" Тогда
			Возврат; // Пропускаем всех, кроме 1С
		КонецЕсли;
		
		НоваяСтрока = Рубрикаторы.Добавить();
		
		НоваяСтрока.Загрузить = Истина;
		НоваяСтрока.Наименование = LOMXDTO.general.title.string.__content;
		НоваяСтрока.Описание = LOMXDTO.general.description.string.__content;
		НоваяСтрока.Идентификатор = LOMXDTO.general.identifier.entry.__content;
		НоваяСтрока.ПутьКФайлуОписания = ФайлОписанияРубрикатора.ПолноеИмя;
		
		НоваяСтрока.ИдентификаторПоставщика = ИдентификаторПоставщика;
		НоваяСтрока.НаименованиеПоставщика  = НаименованиеПоставщика;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Наименование)
			ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.Идентификатор) Тогда
			
			Текст = НСтр("ru = 'Данные о рубрикаторе не найдены'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;	
			
		КонецЕсли;
		
		НоваяСтрока.ЭлектронныйРесурс = ОбщегоНазначенияСУ.ЭлементСправочникаПоИдентификатору("СводыЗнанийСУЗ", НоваяСтрока.Идентификатор);
		НоваяСтрока.Поставщик = ОбщегоНазначенияСУ.ЭлементСправочникаПоИдентификатору("ПоставщикиСУЗ", НоваяСтрока.ИдентификаторПоставщика);
		
	Иначе
		
		Текст = НСтр("ru = 'Файл описания рубрикатора LOM_rubricator.xml не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	/////////////////////////////////////////////////////////////////////////////////
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПутьКФайлуПакета) Тогда
		Текст = НСтр("ru = 'Путь к файлу пакета данных не передан!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Устанавливаем переменные
	
	ПутьКФайлуПакета = Параметры.ПутьКФайлуПакета;
	
	ФайлПакета = Новый Файл(ПутьКФайлуПакета);
	РазмерФайлаПакета = Окр(ФайлПакета.Размер() / 1048576);
	
	// Получаем временный каталог
	
	ПутьКРесурсамПакета = ПолучитьИмяВременногоФайла("");
	ПутьКРесурсамПакета = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКРесурсамПакета);
	
	Попытка
		СоздатьКаталог(ПутьКРесурсамПакета);
	Исключение
		Текст = НСтр("ru = 'Ошибка создания каталога ""%1""'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПутьКРесурсамПакета);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецПопытки;
	
	// Распаковываем пакет
	
	Попытка
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКФайлуПакета);
		ФайлАрхива.ИзвлечьВсе(ПутьКРесурсамПакета, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Заполняем свойства пакета
	
	УстановочныйФайлОбъект = Новый Файл(ПутьКРесурсамПакета + "setup.xml");
	
	Если НЕ УстановочныйФайлОбъект.Существует() Тогда
		Текст = НСтр("ru = 'Файл ""%1"" не найден'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, УстановочныйФайлОбъект.Имя);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;	
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(УстановочныйФайлОбъект.ПолноеИмя);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "db"
			И ЧтениеXML.ИмяАтрибута(0) = "name"
			И ЧтениеXML.ЗначениеАтрибута("name") <> "edu_main" Тогда
				
			КодПакета = ЧтениеXML.ЗначениеАтрибута("name");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодПакета)
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И  ЧтениеXML.Имя = "description" Тогда
			
			ЧтениеXML.Прочитать();
			
			НаименованиеПакета = ЧтениеXML.Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодПакета) 
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "product" Тогда
			
			РедакцияПакета = ЧтениеXML.ЗначениеАтрибута("version");
			ВерсияПакета   = ЧтениеXML.ЗначениеАтрибута("subVersion");
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Если НЕ ЗначениеЗаполнено(НаименованиеПакета) Тогда
		Текст = НСтр("ru = 'Описание пакета не найдено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;	
	КонецЕсли;
	
	// Получаем идентификатор пакета
	
	ИдентификаторПакета = ОбщегоНазначенияСУ.УникальныйИдентификаторИзСтроки(КодПакета);
	
	// Заполняем таблицу рубрикаторов (электронных ресурсов) из отдельных файлов
	
	ФайлыРубрикаторов = НайтиФайлы(ПутьКРесурсамПакета, "DL_RUB_*.zip");	
	
	Для каждого ФайлРубрикатора Из ФайлыРубрикаторов Цикл
		
		ПутьККаталогуФайловРубрикатора = ПутьКРесурсамПакета + ФайлРубрикатора.ИмяБезРасширения;
		ПутьККаталогуФайловРубрикатора = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуФайловРубрикатора);
		
		СоздатьКаталог(ПутьККаталогуФайловРубрикатора);
		
		Попытка
			ФайлАрхива = Новый ЧтениеZIPФайла(ФайлРубрикатора.ПолноеИмя);
			ФайлАрхива.ИзвлечьВсе(ПутьККаталогуФайловРубрикатора, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 				
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
			Возврат;
		КонецПопытки;
		
		ДобавитьРубрикаторВТаблицу(ПутьККаталогуФайловРубрикатора, Отказ);
		
	КонецЦикла;
	
	// Заполняем таблицу рубрикаторов (электронных ресурсов) из общего архива
	
	ФайлОбщегоАрхива = Новый Файл(ПутьКРесурсамПакета + "E4HomeData.dat");
	
	Если ФайлОбщегоАрхива.Существует() Тогда
		
		Попытка
			ФайлАрхива = Новый ЧтениеZIPФайла(ФайлОбщегоАрхива.ПолноеИмя);
			ФайлАрхива.ИзвлечьВсе(ПутьКРесурсамПакета, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 				
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
			Возврат;
		КонецПопытки;
		
		КаталогиРубрикаторов = НайтиФайлы(ПутьКРесурсамПакета, "DL_RUB_*", Истина);
		
		Для каждого КаталогРубрикатора Из КаталогиРубрикаторов Цикл
			
			ДобавитьРубрикаторВТаблицу(КаталогРубрикатора.ПолноеИмя, Отказ);
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	// Заполняем поставщика пакета
	
	Для каждого Строка Из Рубрикаторы Цикл
	
		Если ЗначениеЗаполнено(ПоставщикПакета) Тогда
			
			Если Строка.Поставщик <> ПоставщикПакета Тогда
				
				Текст = НСтр("ru = 'Все рубрикаторы пакета должны иметь одного поставщика'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
				
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			ПоставщикПакета             = Строка.Поставщик;
			ПоставщикПакетаНаименование = Строка.НаименованиеПоставщика;
			
		КонецЕсли;
	
	КонецЦикла;

	
	Если НЕ ЗначениеЗаполнено(ПоставщикПакета) Тогда
		
		Текст = НСтр("ru = 'Поставщик пакета не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		
		Возврат;
		
	КонецЕсли;
	
	
	// Ищем узел обмена
	
	СсылкаНаУзел = ПланыОбмена.ОбменМатериаламиСУЗ.НайтиПоКоду(ИдентификаторПакета);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	Если ВыполнитьИмпортПакетаЦОР() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Импорт успешно завершен'"));
	КонецЕсли;
	
	Оповестить("ЭлектронныйРесурсЗаписан");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
